// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Det går inte att köra programmet.";
"NoDiskArb Informative" = "Det gick inte att starta Disk Arbitration. Detta ska inte hända.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Det går inte att hämta listan med avbildningar.";
"CantGetConfig Informative" = "Ett problem uppstod när listan med tillgängliga avbildningar för återställning skulle hämtas (%1$@). Kontrollera att nätverksanslutningen fungerar.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "det gick inte att tilldela en anslutning";
"CantGetConfig Error DownloadError" = "ett fel uppstod under hämtningen";
"CantGetConfig Error StringCreate" = "svaret gick inte att använda";

/* Version error. */
"VersionError Message" = "Den här versionen av programmet är för gammal.";
"VersionError Informative" = "Hämta en senare version. Det här är version %1$@; version %2$@ eller senare krävs. %3$@";
"VersionError OK" = "Hämta ny version";

/* File dialog to select a local file. */
"SelectLocal File" = "Välj en avbildning:";
"SelectLocal Button" = "Välj";

/* Alert on writing stick. */
"WriteAlert Message" = "Vill du ta bort %1$@ permanent?";
"WriteAlert Informative" = "Alla data på den kommer att försvinna permanent. Detta går inte att ångra.";
"WriteAlert Cancel" = "Radera inte";
"WriteAlert OK" = "Radera";

"TooSmallAlert Message" = "%1$@ kan inte användas. Det är för litet.";
"TooSmallAlert Informative" = "Ett minne med minst %2$@ krävs.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "%1$@ kan inte användas. Det är skrivskyddat.";
"NotWritable Informative" = "Minnet är skrivskyddat. Minnet har eventuellt en spärr som du kan använda för att ta bort skrivskyddet. Annars kan det inte användas.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "Hämtas…";
"Status Verifying" = "Verifierar…";
"Status Unpacking" = "Packar upp…";
"Status Claiming" = "Gör anspråk…";
"Status Unmounting" = "Monterar bort…";
"Status Writing" = "Skriver…";
"Status Ejecting" = "Matar ut…";
"Status Done" = "Klar!";

"StatusAdd Attempt" = " (försök %1$d)";

/* Errors */
"Failure Downloading" = "Ett fel har tyvärr inträffat (det gick inte att hämta källavbildningen). Vill du försöka igen?";
"Failure Verifying Return Value" = "Ett fel har tyvärr inträffat (det gick inte att verifiera källavbildningen, programfel, %1$s). Vill du försöka igen?";
"Failure Verifying SHA Mismatch" = "Ett fel har tyvärr inträffat (det gick inte att verifiera källavbildningen, fel i checksumma ). Vill du försöka igen?";
"Failure Unpacking" = "Ett fel har tyvärr inträffat (det gick inte att packa upp källavbildningen, %1$s). Vill du försöka igen?";
"Failure Claiming" = "Ett fel har tyvärr inträffat (det gick inte att göra anspråk på USB-minnet). Vill du försöka igen?";
"Failure Unmounting" = "Ett fel har tyvärr inträffat (det gick inte att montera bort USB-minnet). Vill du försöka igen?";
"Failure Opening Source Image" = "Ett fel har tyvärr inträffat (det gick inte att öppna källavbildningen, %1$s). Vill du försöka igen?";
"Failure Opening Destination Device" = "Ett fel har tyvärr inträffat (det gick inte att öppna USB-minnet, %1$s). Vill du försöka igen?";
"Failure Reading Source Image" = "Ett fel har tyvärr inträffat (det gick inte att läsa källavbildningen, %1$s). Vill du försöka igen?";
"Failure Writing Destination Device" = "Ett fel har tyvärr inträffat (det gick inte att skriva data till USB-minnet, %1$s). Vill du försöka igen?";
"Failure Ejecting" = "Ett fel har tyvärr inträffat (det gick inte att mata ut USB-minnet). Vill du försöka igen?";

"Failure Try Again" = "Försök igen";
"Failure Quit" = "Avsluta";

"Failure Termination Status" = "Status för avslut %d";

"Failure Internal Error 1" = "Oväntat EOF";
